#### Terraform working directory 🏠: `demo/demo-account/network/vpc`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.vpc.module.extra_endpoints["Eric-Test-VPC"].aws_vpc_endpoint.this["s3_Gateway"] will be destroyed
  # (because module.vpc.module.extra_endpoints["Eric-Test-VPC"] is not in configuration)
  - resource "aws_vpc_endpoint" "this" {
      - arn                   = "arn:aws:ec2:ap-southeast-1:129980683758:vpc-endpoint/vpce-04bb7a8548a50a9d2" -> null
      - cidr_blocks           = [
          - "52.219.32.0/21",
          - "3.5.146.0/23",
          - "18.34.248.0/22",
          - "3.5.148.0/22",
          - "18.34.64.0/21",
          - "52.219.40.0/22",
          - "52.219.124.0/22",
          - "52.219.128.0/21",
          - "52.219.184.0/21",
          - "16.12.48.0/21",
          - "52.219.164.0/22",
          - "52.219.180.0/22",
        ] -> null
      - dns_entry             = [] -> null
      - id                    = "vpce-04bb7a8548a50a9d2" -> null
      - network_interface_ids = [] -> null
      - owner_id              = "129980683758" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - prefix_list_id        = "pl-6fa54006" -> null
      - private_dns_enabled   = false -> null
      - requester_managed     = false -> null
      - route_table_ids       = [
          - "rtb-0aebe98411d88b01d",
        ] -> null
      - security_group_ids    = [] -> null
      - service_name          = "com.amazonaws.ap-southeast-1.s3" -> null
      - state                 = "available" -> null
      - subnet_ids            = [] -> null
      - tags                  = {
          - "Name" = "s3-gateway-endpoint"
        } -> null
      - tags_all              = {
          - "Name" = "s3-gateway-endpoint"
        } -> null
      - vpc_endpoint_type     = "Gateway" -> null
      - vpc_id                = "vpc-00fb718453998c438" -> null

      - timeouts {
          - create = "10m" -> null
          - delete = "10m" -> null
          - update = "10m" -> null
        }
    }

  # module.vpc.module.extra_endpoints["Eric-Test-VPC"].aws_vpc_endpoint.this["s3_Interface"] will be destroyed
  # (because module.vpc.module.extra_endpoints["Eric-Test-VPC"] is not in configuration)
  - resource "aws_vpc_endpoint" "this" {
      - arn                   = "arn:aws:ec2:ap-southeast-1:129980683758:vpc-endpoint/vpce-0d96f914e94bfab80" -> null
      - cidr_blocks           = [
          - "52.219.32.0/21",
          - "3.5.146.0/23",
          - "18.34.248.0/22",
          - "3.5.148.0/22",
          - "18.34.64.0/21",
          - "52.219.40.0/22",
          - "52.219.124.0/22",
          - "52.219.128.0/21",
          - "52.219.184.0/21",
          - "16.12.48.0/21",
          - "52.219.164.0/22",
          - "52.219.180.0/22",
        ] -> null
      - dns_entry             = [
          - {
              - dns_name       = "*.vpce-0d96f914e94bfab80-bhqoa8ym.s3.ap-southeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z18LLCSTV4NVNL"
            },
          - {
              - dns_name       = "*.vpce-0d96f914e94bfab80-bhqoa8ym-ap-southeast-1a.s3.ap-southeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z18LLCSTV4NVNL"
            },
          - {
              - dns_name       = "*.vpce-0d96f914e94bfab80-bhqoa8ym-ap-southeast-1b.s3.ap-southeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z18LLCSTV4NVNL"
            },
        ] -> null
      - id                    = "vpce-0d96f914e94bfab80" -> null
      - ip_address_type       = "ipv4" -> null
      - network_interface_ids = [
          - "eni-01caa54f07471034d",
          - "eni-069a66bd1572d0bd3",
        ] -> null
      - owner_id              = "129980683758" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
            }
        ) -> null
      - prefix_list_id        = "pl-6fa54006" -> null
      - private_dns_enabled   = false -> null
      - requester_managed     = false -> null
      - route_table_ids       = [] -> null
      - security_group_ids    = [
          - "sg-06cc4fe3facaec550",
        ] -> null
      - service_name          = "com.amazonaws.ap-southeast-1.s3" -> null
      - state                 = "available" -> null
      - subnet_ids            = [
          - "subnet-09516cd4ae3be0cad",
          - "subnet-0a7eb6047719c19ea",
        ] -> null
      - tags                  = {
          - "Name" = "s3-interface-endpoint"
        } -> null
      - tags_all              = {
          - "Name" = "s3-interface-endpoint"
        } -> null
      - vpc_endpoint_type     = "Interface" -> null
      - vpc_id                = "vpc-00fb718453998c438" -> null

      - dns_options {
          - dns_record_ip_type                             = "ipv4" -> null
          - private_dns_only_for_inbound_resolver_endpoint = false -> null
        }

      - timeouts {
          - create = "10m" -> null
          - delete = "10m" -> null
          - update = "10m" -> null
        }
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_default_security_group.this[0] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_default_security_group" "this" {
      - arn                    = "arn:aws:ec2:ap-southeast-1:129980683758:security-group/sg-06cc4fe3facaec550" -> null
      - description            = "default VPC security group" -> null
      - egress                 = [] -> null
      - id                     = "sg-06cc4fe3facaec550" -> null
      - ingress                = [] -> null
      - name                   = "default" -> null
      - owner_id               = "129980683758" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "Eric-Test-VPC"
        } -> null
      - tags_all               = {
          - "Name" = "Eric-Test-VPC"
        } -> null
      - vpc_id                 = "vpc-00fb718453998c438" -> null
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_internet_gateway.this[0] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:ap-southeast-1:129980683758:internet-gateway/igw-029a10cf0ac6b51b6" -> null
      - id       = "igw-029a10cf0ac6b51b6" -> null
      - owner_id = "129980683758" -> null
      - tags     = {
          - "Name" = "Eric-Test-VPC"
        } -> null
      - tags_all = {
          - "Name" = "Eric-Test-VPC"
        } -> null
      - vpc_id   = "vpc-00fb718453998c438" -> null
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_route.public_internet_gateway[0] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_route" "public_internet_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-029a10cf0ac6b51b6" -> null
      - id                     = "r-rtb-0aebe98411d88b01d1080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0aebe98411d88b01d" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_route_table.intra[0] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_route_table" "intra" {
      - arn              = "arn:aws:ec2:ap-southeast-1:129980683758:route-table/rtb-0b6279b8f275d3f5c" -> null
      - id               = "rtb-0b6279b8f275d3f5c" -> null
      - owner_id         = "129980683758" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name"           = "Eric-Test-VPC-Intra-RT"
          - "RouteTableType" = "intra"
        } -> null
      - tags_all         = {
          - "Name"           = "Eric-Test-VPC-Intra-RT"
          - "RouteTableType" = "intra"
        } -> null
      - vpc_id           = "vpc-00fb718453998c438" -> null
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_route_table.public[0] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:ap-southeast-1:129980683758:route-table/rtb-0aebe98411d88b01d" -> null
      - id               = "rtb-0aebe98411d88b01d" -> null
      - owner_id         = "129980683758" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-029a10cf0ac6b51b6"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name"           = "Eric-Test-VPC-PUBLIC-RT"
          - "RouteTableType" = "public"
        } -> null
      - tags_all         = {
          - "Name"           = "Eric-Test-VPC-PUBLIC-RT"
          - "RouteTableType" = "public"
        } -> null
      - vpc_id           = "vpc-00fb718453998c438" -> null
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_route_table_association.intra[0] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_route_table_association" "intra" {
      - id             = "rtbassoc-05730eb43a2eef75e" -> null
      - route_table_id = "rtb-0b6279b8f275d3f5c" -> null
      - subnet_id      = "subnet-09516cd4ae3be0cad" -> null
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_route_table_association.intra[1] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_route_table_association" "intra" {
      - id             = "rtbassoc-0b424be2b20dff962" -> null
      - route_table_id = "rtb-0b6279b8f275d3f5c" -> null
      - subnet_id      = "subnet-0a7eb6047719c19ea" -> null
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_route_table_association.public[0] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-09b4d89d61c49b5ad" -> null
      - route_table_id = "rtb-0aebe98411d88b01d" -> null
      - subnet_id      = "subnet-097ae07c8356d88ef" -> null
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_route_table_association.public[1] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-091446e96e4a7602c" -> null
      - route_table_id = "rtb-0aebe98411d88b01d" -> null
      - subnet_id      = "subnet-0619181a28053ea58" -> null
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_subnet.intra[0] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_subnet" "intra" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-09516cd4ae3be0cad" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1a" -> null
      - availability_zone_id                           = "apse1-az1" -> null
      - cidr_block                                     = "172.17.64.0/19" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-09516cd4ae3be0cad" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "129980683758" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Account"     = "Lab"
          - "Environment" = "Sandbox"
          - "Name"        = "Eric-Test-VPC-Intra-a"
        } -> null
      - tags_all                                       = {
          - "Account"     = "Lab"
          - "Environment" = "Sandbox"
          - "Name"        = "Eric-Test-VPC-Intra-a"
        } -> null
      - vpc_id                                         = "vpc-00fb718453998c438" -> null
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_subnet.intra[1] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_subnet" "intra" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-0a7eb6047719c19ea" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1b" -> null
      - availability_zone_id                           = "apse1-az2" -> null
      - cidr_block                                     = "172.17.96.0/19" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0a7eb6047719c19ea" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "129980683758" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Account"     = "Lab"
          - "Environment" = "Sandbox"
          - "Name"        = "Eric-Test-VPC-Intra-b"
        } -> null
      - tags_all                                       = {
          - "Account"     = "Lab"
          - "Environment" = "Sandbox"
          - "Name"        = "Eric-Test-VPC-Intra-b"
        } -> null
      - vpc_id                                         = "vpc-00fb718453998c438" -> null
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_subnet.public[0] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-097ae07c8356d88ef" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1a" -> null
      - availability_zone_id                           = "apse1-az1" -> null
      - cidr_block                                     = "172.17.192.0/19" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-097ae07c8356d88ef" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "129980683758" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Account"     = "Lab"
          - "Environment" = "Sandbox"
          - "Name"        = "Eric-Test-VPC-Public-a"
        } -> null
      - tags_all                                       = {
          - "Account"     = "Lab"
          - "Environment" = "Sandbox"
          - "Name"        = "Eric-Test-VPC-Public-a"
        } -> null
      - vpc_id                                         = "vpc-00fb718453998c438" -> null
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_subnet.public[1] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-0619181a28053ea58" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1b" -> null
      - availability_zone_id                           = "apse1-az2" -> null
      - cidr_block                                     = "172.17.224.0/19" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0619181a28053ea58" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "129980683758" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Account"     = "Lab"
          - "Environment" = "Sandbox"
          - "Name"        = "Eric-Test-VPC-Public-b"
        } -> null
      - tags_all                                       = {
          - "Account"     = "Lab"
          - "Environment" = "Sandbox"
          - "Name"        = "Eric-Test-VPC-Public-b"
        } -> null
      - vpc_id                                         = "vpc-00fb718453998c438" -> null
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_vpc.this[0] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:ap-southeast-1:129980683758:vpc/vpc-00fb718453998c438" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "172.17.0.0/16" -> null
      - default_network_acl_id               = "acl-0cfb476ab0b39eb2f" -> null
      - default_route_table_id               = "rtb-003e67a0957e4c334" -> null
      - default_security_group_id            = "sg-06cc4fe3facaec550" -> null
      - dhcp_options_id                      = "dopt-03ae0a4f720d5dab2" -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-00fb718453998c438" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-003e67a0957e4c334" -> null
      - owner_id                             = "129980683758" -> null
      - tags                                 = {
          - "Account"     = "Lab"
          - "Environment" = "Sandbox"
          - "Name"        = "Eric-Test-VPC"
        } -> null
      - tags_all                             = {
          - "Account"     = "Lab"
          - "Environment" = "Sandbox"
          - "Name"        = "Eric-Test-VPC"
        } -> null
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_vpc_dhcp_options.this[0] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_vpc_dhcp_options" "this" {
      - arn                  = "arn:aws:ec2:ap-southeast-1:129980683758:dhcp-options/dopt-03ae0a4f720d5dab2" -> null
      - domain_name          = "abc.example.com" -> null
      - domain_name_servers  = [
          - "10.0.0.1",
          - "10.0.0.2",
        ] -> null
      - id                   = "dopt-03ae0a4f720d5dab2" -> null
      - netbios_name_servers = [] -> null
      - ntp_servers          = [
          - "169.254.169.123",
          - "10.10.10.10",
        ] -> null
      - owner_id             = "129980683758" -> null
      - tags                 = {
          - "Name" = "Eric-Test-VPC"
        } -> null
      - tags_all             = {
          - "Name" = "Eric-Test-VPC"
        } -> null
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_vpc_dhcp_options_association.this[0] will be destroyed
  # (because module.vpc.module.vpc["Eric-Test-VPC"] is not in configuration)
  - resource "aws_vpc_dhcp_options_association" "this" {
      - dhcp_options_id = "dopt-03ae0a4f720d5dab2" -> null
      - id              = "dopt-03ae0a4f720d5dab2-vpc-00fb718453998c438" -> null
      - vpc_id          = "vpc-00fb718453998c438" -> null
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Eric-Test-VPC-2"
        }
      + tags_all               = {
          + "Name" = "Eric-Test-VPC-2"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "Eric-Test-VPC-2-ap-southeast-1a"
        }
      + tags_all             = {
          + "Name" = "Eric-Test-VPC-2-ap-southeast-1a"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "Eric-Test-VPC-2-ap-southeast-1b"
        }
      + tags_all             = {
          + "Name" = "Eric-Test-VPC-2-ap-southeast-1b"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "Eric-Test-VPC-2"
        }
      + tags_all = {
          + "Name" = "Eric-Test-VPC-2"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-2-ap-southeast-1a"
        }
      + tags_all                           = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-2-ap-southeast-1a"
        }
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-2-ap-southeast-1b"
        }
      + tags_all                           = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-2-ap-southeast-1b"
        }
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_network_acl.tgw[0] will be created
  + resource "aws_network_acl" "tgw" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "Eric-Test-VPC-2-tgw"
        }
      + tags_all   = {
          + "Name" = "Eric-Test-VPC-2-tgw"
        }
      + vpc_id     = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_network_acl_rule.tgw_inbound[0] will be created
  + resource "aws_network_acl_rule" "tgw_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_network_acl_rule.tgw_outbound[0] will be created
  + resource "aws_network_acl_rule" "tgw_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route_table.intra[0] will be created
  + resource "aws_route_table" "intra" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"           = "Eric-Test-VPC-Intra-RT"
          + "RouteTableType" = "intra"
        }
      + tags_all         = {
          + "Name"           = "Eric-Test-VPC-Intra-RT"
          + "RouteTableType" = "intra"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"           = "Eric-Test-VPC-Private-RT"
          + "RouteTableType" = "private"
        }
      + tags_all         = {
          + "Name"           = "Eric-Test-VPC-Private-RT"
          + "RouteTableType" = "private"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"           = "Eric-Test-VPC-Private-RT"
          + "RouteTableType" = "private"
        }
      + tags_all         = {
          + "Name"           = "Eric-Test-VPC-Private-RT"
          + "RouteTableType" = "private"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"           = "Eric-Test-VPC-PUBLIC-RT"
          + "RouteTableType" = "public"
        }
      + tags_all         = {
          + "Name"           = "Eric-Test-VPC-PUBLIC-RT"
          + "RouteTableType" = "public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route_table.tgw[0] will be created
  + resource "aws_route_table" "tgw" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"           = "Eric-Test-VPC-TGW-RT"
          + "RouteTableType" = "tgw"
        }
      + tags_all         = {
          + "Name"           = "Eric-Test-VPC-TGW-RT"
          + "RouteTableType" = "tgw"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route_table_association.intra[0] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route_table_association.intra[1] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route_table_association.tgw[0] will be created
  + resource "aws_route_table_association" "tgw" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_route_table_association.tgw[1] will be created
  + resource "aws_route_table_association" "tgw" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_subnet.intra[0] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.64.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Intra-a"
        }
      + tags_all                                       = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Intra-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_subnet.intra[1] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.96.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Intra-b"
        }
      + tags_all                                       = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Intra-b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.0.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Private-a"
        }
      + tags_all                                       = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Private-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.32.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Private-b"
        }
      + tags_all                                       = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Private-b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.192.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Public-a"
        }
      + tags_all                                       = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Public-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.224.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Public-b"
        }
      + tags_all                                       = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Public-b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_subnet.tgw[0] will be created
  + resource "aws_subnet" "tgw" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.128.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-TGW-a"
        }
      + tags_all                                       = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-TGW-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_subnet.tgw[1] will be created
  + resource "aws_subnet" "tgw" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.160.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-TGW-b"
        }
      + tags_all                                       = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-TGW-b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "172.17.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-2"
        }
      + tags_all                             = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-2"
        }
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_vpc_dhcp_options.this[0] will be created
  + resource "aws_vpc_dhcp_options" "this" {
      + arn                  = (known after apply)
      + domain_name          = "abc.example.com"
      + domain_name_servers  = [
          + "10.0.0.1",
          + "10.0.0.2",
        ]
      + id                   = (known after apply)
      + netbios_name_servers = []
      + ntp_servers          = [
          + "169.254.169.123",
          + "10.10.10.10",
        ]
      + owner_id             = (known after apply)
      + tags                 = {
          + "Name" = "Eric-Test-VPC-2"
        }
      + tags_all             = {
          + "Name" = "Eric-Test-VPC-2"
        }
    }

  # module.vpc.module.vpc["Eric-Test-VPC-2"].aws_vpc_dhcp_options_association.this[0] will be created
  + resource "aws_vpc_dhcp_options_association" "this" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

Plan: 36 to add, 0 to change, 18 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
